In [24]:
#Import libraries
import numpy as np
import pandas as pd

In [10]:
#read data    
data = pd.read_csv('Dataset.csv')
#show data
data.head(10)

   Size  Bedrooms   Price
0  2104         3  399900
1  1600         3  329900
2  2400         3  369000
3  1416         2  232000
4  3000         4  539900
5  1985         4  299900
6  1534         3  314900
7  1427         3  198999
8  1380         3  212000
9  1494         3  242500

In [11]:
data.describe()

              Size   Bedrooms          Price
count    47.000000  47.000000      47.000000
mean   2000.680851   3.170213  340412.659574
std     794.702354   0.760982  125039.899586
min     852.000000   1.000000  169900.000000
25%    1432.000000   3.000000  249900.000000
50%    1888.000000   3.000000  299900.000000
75%    2269.000000   4.000000  384450.000000
max    4478.000000   5.000000  699900.000000

In [12]:
# add ones column
data.insert(0, 'Ones', 1)
data.head()

   Ones  Size  Bedrooms   Price
0     1  2104         3  399900
1     1  1600         3  329900
2     1  2400         3  369000
3     1  1416         2  232000
4     1  3000         4  539900

In [13]:
# separate X (training data) from y (target variable)
cols = data.shape[1]
x = data.iloc[:,0:cols-1]
y = data.iloc[:,cols-1:cols]

In [14]:
# convert to matrices and 
x = np.matrix(x.values)
y = np.matrix(y.values)

In [15]:
def normalEqn(X, y):
    '''
    normalEqn(X,y) computes the closed-form solution to linear 
    regression using the normal equations.
    '''
    # initialize theta
    theta = np.zeros((np.shape(X)[1], 1))
    # Implement Normal Equation
    theta = np.dot(np.dot(np.linalg.inv(np.dot(X.T, X)), X.T), y)
    
    return theta

In [17]:
theta = normalEqn(x, y)

In [18]:
theta

matrix([[89597.9095428 ],
        [  139.21067402],
        [-8738.01911233]])

## Estimate the price of a 1500 sq-ft, 2 br house

In [21]:
# See if we get the same prediction as before for a 1500 sq-ft, 2 br house
sample_X = np.array([1500., 2.])
sample_X = np.insert(sample_X, 0, 1)

In [23]:
price = float(np.dot(theta.T, sample_X))
print('Predicted price of a 1500 sq-ft, 2 br house is $%.0f.' % price)

Predicted price of a 1500 sq-ft, 2 br house is $280938.